In [1]:
# Import Dependencies
import pandas as pd

# importing numpy as np 
import numpy as np

In [2]:
#LOADING DATA: Student Complete Data File to Load
students_path = "Resources/students_complete.csv"

# Read the modified Students Complete csv and store into Pandas DataFrame
students_df = pd.read_csv(students_path, encoding="utf-8")
students_df.head()

#Consider confirming with Huang High School that teachers are not accidentally present in dataset - i.e. Dr. Richard Scott

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [3]:
#DATA CLEANING: identify any incomplete rows
students_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [4]:
# LOADING DATA: Schools Complete Data File to Load
schools_path = "Resources/schools_complete.csv"

# Read the modified Schools Complete csv and store into Pandas DataFrame
schools_df = pd.read_csv(schools_path, encoding="utf-8")
schools_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [5]:
#DATA CLEANING: identify any incomplete rows
schools_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [6]:
#DATA CLEANING: detect any duplicates or misspellings
schools_df['school_name'].value_counts()

Hernandez High School    1
Bailey High School       1
Huang High School        1
Rodriguez High School    1
Shelton High School      1
Johnson High School      1
Wilson High School       1
Thomas High School       1
Pena High School         1
Holden High School       1
Griffin High School      1
Figueroa High School     1
Wright High School       1
Cabrera High School      1
Ford High School         1
Name: school_name, dtype: int64

In [7]:
#DATA CLEANING: Identify data types
#merge_table.dtypes

In [8]:
# MERGING TABLES: merge two dataframes using an outer join
#merge_table = pd.merge(students_df, schools_df, on="school_name", how="outer")
#merge_table.head()

In [9]:
# Find students "passing Math" with a 70% or above
#passing_math = merge_table.loc[merge_table["math_score"] >= 70, [
    #'Student ID', 'student_name', 'gender', 'grade', 'school_name',
     #  'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget', ]]
#passing_math.head()

In [10]:
# Find students "passing Math" with a 70% or above
passing_math_df = students_df.loc[students_df["math_score"]>= 70, :]
passing_math_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
8,8,Michael Roth,M,10th,Huang High School,95,87

In [11]:
# Find students "passing Reading" with a 70% or above
passing_reading_df = students_df.loc[students_df["reading_score"]>= 70, :]
passing_reading_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80

In [12]:
# Find students "passing Reading" with a 70% or above
#passing_reading = merge_table.loc[merge_table["reading_score"] >= 70, [
    #'Student ID', 'student_name', 'gender', 'grade', 'school_name',
       #'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget', ]]
#passing_reading.head()

In [13]:
# Create a new DataFrame that looks into a specific school
#baileyhs = merge_table.loc[merge_table["school_name"] == "Bailey High School"]
#baileyhs.head()

In [14]:
# Count how many students are in each school
#student_school_counts_series = merge_table["school_name"].value_counts()
#student_school_counts_series

In [15]:
# Convert the student_school_counts Series into a DataFrame
#student_school_counts_df = pd.DataFrame(student_school_counts_series)
#student_school_counts_df

In [16]:
# Using GroupBy in order to separate the data into fields according to "state" values
#grouped_merge_table = merge_table.groupby(['school_name'])

# The object returned is a "GroupBy" object and cannot be viewed normally...
#print(grouped_merge_table)

# In order to be visualized, a data function must be used...
#grouped_merge_table.count().head(10)

District Summary

In [17]:
# High-level snapshot of districts key metrics

#Total Schools
schools_total = schools_df["school_name"].count()
schools_total

#Total Students
students_total = students_df["Student ID"].count()
students_total

#Total Budget
budget_total = schools_df["budget"].sum()
budget_total

#Average Math Score
math_average_total = students_df["math_score"].mean()
math_average_total_round = round(math_average_total, 6)
math_average_total_round

#Average Reading Score
reading_average_total = students_df["reading_score"].mean()
reading_average_total_round = round(reading_average_total, 6)
reading_average_total_round

# % Passing Math
passing_math_total = (passing_math_df["Student ID"].count()/ students_total) * 100
passing_math_total_round = round(passing_math_total, 6)
passing_math_total_round

# % Passing Reading
passing_reading_total = (passing_reading_df["Student ID"].count()/ students_total) * 100
passing_reading_total_round = round(passing_reading_total, 6)
passing_reading_total_round

# Overall Passing Rate
overall_passing_rate = (passing_reading_total_round + passing_math_total_round)/2
overall_passing_rate

# Creating a summary DataFrame using above values
high_level_snapshot_df = pd.DataFrame({"Total Schools": [schools_total],
                           "Total Students": [students_total],
                           "Total Budget": [budget_total],
                           "Average Math Score": [math_average_total_round],
                           "Average Reading Score": [reading_average_total_round],
                           "% Passing Math": [passing_math_total_round],
                           "% Passing Reading": [passing_reading_total_round],
                           "Overall Passing Rate": [overall_passing_rate]})

high_level_snapshot_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,80.393158

In [18]:
#average_reading_score = students_df.groupby('school_name')['reading_score'].mean()
#average_reading_score

#avg_reading_score_df = pd.DataFrame({'school_name':average_reading_score.index, 'avg_reading_score':average_reading_score.values})
#avg_reading_score_df

In [19]:
#average_math_score = students_df.groupby('school_name')['math_score'].mean()
#average_math_score

#avg_math_score_df = pd.DataFrame({'school_name':average_math_score.index, 'avg_math_score':average_math_score.values})
#avg_math_score_df

In [20]:
#number of students passing math by highschool
#count_passing_math = passing_math_df.groupby('school_name')['math_score'].count()
#count_passing_math

#count_passing_math_df = pd.DataFrame({'school_name':count_passing_math.index, 'count_passing_math':count_passing_math.values})
#count_passing_math_df

In [21]:
#number of students passing reading by highschool
#count_passing_reading = passing_reading_df.groupby('school_name')['reading_score'].count()
#count_passing_reading

#count_passing_reading_df = pd.DataFrame({'school_name':count_passing_reading.index, 'count_passing_reading':count_passing_reading.values})
#count_passing_reading_df

In [22]:
# Merge two dataframes using an outer join
#schools_join_avgread_df = pd.merge(schools_df, avg_reading_score_df, on="school_name", how="outer")
#merge_table = pd.merge(students_df[['school_name', 'gender', 'grade']], schools_df, on="school_name", how="outer")
#schools_join_avgread_df.head()

In [23]:
# Merge two dataframes using an outer join
#schools_join_avgmath_df = pd.merge(schools_join_avgread_df, avg_math_score_df, on="school_name", how="outer")
#merge_table = pd.merge(students_df[['school_name', 'gender', 'grade']], schools_df, on="school_name", how="outer")
#schools_join_avgmath_df.head()

In [24]:
# Merge two dataframes using an outer join
#schools_join_countread_df = pd.merge(schools_join_avgmath_df, count_passing_reading_df, on="school_name", how="outer")
#merge_table = pd.merge(students_df[['school_name', 'gender', 'grade']], schools_df, on="school_name", how="outer")
#schools_join_countread_df.head()

In [25]:
# Merge two dataframes using an outer join
#schools_join_countmath_df = pd.merge(schools_join_countread_df, count_passing_math_df, on="school_name", how="outer")
#merge_table = pd.merge(students_df[['school_name', 'gender', 'grade']], schools_df, on="school_name", how="outer")
#schools_join_countmath_df.head()

In [26]:
#schools_join_countmath_df['percent_passing_math'] = (schools_join_countmath_df["count_passing_math"]/ schools_join_countmath_df["size"]) * 100
#schools_join_countmath_df

In [27]:
#schools_join_countmath_df['percent_passing_reading'] = (schools_join_countmath_df["count_passing_reading"]/ schools_join_countmath_df["size"]) * 100
#schools_join_countmath_df

In [28]:
#schools_join_countmath_df['Overall_passing_rate'] = (schools_join_countmath_df["percent_passing_reading"] + schools_join_countmath_df["percent_passing_math"])/ 2
#schools_join_countmath_df.head()

In [29]:
#Calculating per student budget
#schools_join_countmath_df['Per_student_budget'] = (schools_join_countmath_df["budget"] / schools_join_countmath_df["size"])
#schools_join_countmath_df.head()

School Summary

In [56]:
#SCHOOL SUMMARY

#Average Reading Score by School
average_reading_score = students_df.groupby('school_name')['reading_score'].mean()
average_reading_score

avg_reading_score_df = pd.DataFrame({'school_name':average_reading_score.index, 'avg_reading_score':average_reading_score.values})
avg_reading_score_df

#Average Math Score by School
average_math_score = students_df.groupby('school_name')['math_score'].mean()
average_math_score

avg_math_score_df = pd.DataFrame({'school_name':average_math_score.index, 'avg_math_score':average_math_score.values})
avg_math_score_df

#Count of students passing Math by School
count_passing_math = passing_math_df.groupby('school_name')['math_score'].count()
count_passing_math

count_passing_math_df = pd.DataFrame({'school_name':count_passing_math.index, 'count_passing_math':count_passing_math.values})
count_passing_math_df

#Count of students passing Reading by School
count_passing_reading = passing_reading_df.groupby('school_name')['reading_score'].count()
count_passing_reading

count_passing_reading_df = pd.DataFrame({'school_name':count_passing_reading.index, 'count_passing_reading':count_passing_reading.values})
count_passing_reading_df

# Joining Schools with Average Reading Score 
schools_join_avgread_df = pd.merge(schools_df, avg_reading_score_df, on="school_name", how="outer")
schools_join_avgread_df.head()

# Joining Schools with Average Math Score
schools_join_avgmath_df = pd.merge(schools_join_avgread_df, avg_math_score_df, on="school_name", how="outer")
schools_join_avgmath_df.head()

# Joining Schools with Count of Students Passing Reading by School
schools_join_countread_df = pd.merge(schools_join_avgmath_df, count_passing_reading_df, on="school_name", how="outer")
schools_join_countread_df.head()

# Joining Schools with Count of Students Passing Math by School
schools_join_countmath_df = pd.merge(schools_join_countread_df, count_passing_math_df, on="school_name", how="outer")
schools_join_countmath_df.head()

#Calculating Percent of Students Passing Math by School
schools_join_countmath_df['percent_passing_math'] = (schools_join_countmath_df["count_passing_math"]/ schools_join_countmath_df["size"]) * 100
schools_join_countmath_df

#Calculating Percent of Student Passing Reading by School
schools_join_countmath_df['percent_passing_reading'] = (schools_join_countmath_df["count_passing_reading"]/ schools_join_countmath_df["size"]) * 100
schools_join_countmath_df

#Calculating Overall Passing Rate by School
schools_join_countmath_df['Overall_passing_rate'] = (schools_join_countmath_df["percent_passing_reading"] + schools_join_countmath_df["percent_passing_math"])/ 2
schools_join_countmath_df.head()

#Calculating Budget per Student by School
schools_join_countmath_df['Per_student_budget'] = (schools_join_countmath_df["budget"] / schools_join_countmath_df["size"])
schools_join_countmath_df.head()

#Rename dataframe for future use in Scores by School Spending
schools_summary_noformat_df = schools_join_countmath_df
schools_summary_noformat_df.head()

#Rename dataframe for future use in Scores by School Type
schools_summary_noformat_fortype_df = schools_join_countmath_df
schools_summary_noformat_fortype_df.head()

#Renaming columns in dataframe
school_rename_df = schools_summary_noformat_df.rename(columns={"school_name":"School Name", 
                                                             "type":"School Type",
                                                             "size": "Total Students", 
                                                             "budget": "Total School Budget", 
                                                             "Per_student_budget": "Per Student Budget", 
                                                             "avg_math_score": "Average Math Score",
                                                             "avg_reading_score": "Average Reading Score",
                                                             "percent_passing_math": "% Passing Math",
                                                             "percent_passing_reading": "% Passing Reading",
                                                             "Overall_passing_rate": "% Overall Passing Rate"})

school_rename_df.head()

#Reformating columns in dataframe
school_rename_df["Total School Budget"] = school_rename_df["Total School Budget"].map("${:,.2f}".format)
school_rename_df["Per Student Budget"] = school_rename_df["Per Student Budget"].map("${:,.2f}".format)
school_rename_df.head()

#Creating final dataframe
school_summary_df = school_rename_df.loc[:, ['School Name', 'School Type', 'Total Students',
       'Total School Budget', 'Per Student Budget','Average Reading Score', 'Average Math Score',
       '% Passing Math','% Passing Reading', '% Overall Passing Rate']]

school_summary_df

,School Name,School Type,Total Students,Total School Budget,Per Student Budget,Average Reading Score,Average Math Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,Huang High School,District,2917,"$1,910,635.00",$655.00,81.182722,76.629414,65.683922,81.316421,73.500171
1,Figueroa High School,District,2949,"$1,884,411.00",$639.00,81.158020,76.711767,65.988471,80.739234,73.363852
2,Shelton High School,Charter,1761,"$1,056,600.00",$600.00,83.725724,83.359455,93.867121,95.854628,94.860875
3,Hernandez High School,District,4635,"$3,022,020.00",$652.00,80.934412,77.289752,66.752967,80.862999,73.807983
4,Griffin High School,Charter,1468,"$917,500.00",$625.00,83.816757,83.351499,93.392371,97.138965,95.265668
5,Wilson High School,Charter,2283,"$1,319,574.00",$578.00,83.989488,83.274201,93.867718,96.539641,95.203679
6,Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.975780,83.061895,94.133477,97.039828,95.586652
7,Bailey High School,District,4976,"$3,124,928.00",$628.00,81.033963,77.048432,66.680064,81.933280,74.306672
8,Holden High School,Charter,427,"$248,087.00",$581.00,83.814988,83.803279,92.505855,96.252927,94.379391
9,Pena High School,Charter,962,"$585,858.00",$609.00,84.044699,83.839917,94.594595,95.945946,95.270270
10,Wright High School,Charter,1800,"$1,049,400.00",$583.00,83.955000,83.682222,93.333333,96.611111,94.972222
11,Rodriguez High School,District,3999,"$2,547,363.00",$637.00,80.744686,76.842711,66.366592,80.220055,73.293323
12,Johnson High School,District,4761,"$3,094,650.00",$650.00,80.966394,77.072464,66.057551,81.222432,73.639992
13,Ford High School,District,2739,"$1,763,916.00",$644.00,80.746258,77.102592,68.309602,79.299014,73.804308
14,Thomas High School,Charter,1635,"$1,043,130.00",$638.00,83.848930,83.418349,93.272171,97.308869,95.290520

Top Performing Schools By Pass Rate

In [47]:
#Top Performing Schools By Pass Rate
top_schools_df = school_summary_df.sort_values("% Overall Passing Rate", ascending=False)
#top_schools_df.head(5)

top_schoos_new_index = top_schools_df.reset_index(drop=True)
top_schoos_new_index.head()

,School Name,School Type,Total Students,Total School Budget,Per Student Budget,Average Reading Score,Average Math Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.975780,83.061895,94.133477,97.039828,95.586652
1,Thomas High School,Charter,1635,"$1,043,130.00",$638.00,83.848930,83.418349,93.272171,97.308869,95.290520
2,Pena High School,Charter,962,"$585,858.00",$609.00,84.044699,83.839917,94.594595,95.945946,95.270270
3,Griffin High School,Charter,1468,"$917,500.00",$625.00,83.816757,83.351499,93.392371,97.138965,95.265668
4,Wilson High School,Charter,2283,"$1,319,574.00",$578.00,83.989488,83.274201,93.867718,96.539641,95.203679

Bottom Performing Schools By Pass Rate

In [48]:
#Bottom Performing Schools By Pass Rate
bottom_schools_df = school_summary_df.sort_values("% Overall Passing Rate", ascending=True)
#top_schools_df.head(5)

bottom_schoos_new_index = bottom_schools_df.reset_index(drop=True)
bottom_schoos_new_index.head()

,School Name,School Type,Total Students,Total School Budget,Per Student Budget,Average Reading Score,Average Math Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,Rodriguez High School,District,3999,"$2,547,363.00",$637.00,80.744686,76.842711,66.366592,80.220055,73.293323
1,Figueroa High School,District,2949,"$1,884,411.00",$639.00,81.158020,76.711767,65.988471,80.739234,73.363852
2,Huang High School,District,2917,"$1,910,635.00",$655.00,81.182722,76.629414,65.683922,81.316421,73.500171
3,Johnson High School,District,4761,"$3,094,650.00",$650.00,80.966394,77.072464,66.057551,81.222432,73.639992
4,Ford High School,District,2739,"$1,763,916.00",$644.00,80.746258,77.102592,68.309602,79.299014,73.804308

In [33]:
#Math Scores By Grade DO NOT USE, NOT IN SPECIFIED FORMAT
#math_score_students_school = students_df.groupby(['school_name', "grade"])
#math_mean = math_score_students_school.mean()
#math_mean.head()

#OTHER ATTEMPTS AT REFORMATTING
#math_mean_test = math_mean.loc["school_name"]
#math_mean_test
#math_mean_test.keys()
#math_mean.keys()
#math_index = math_mean.index.names

#math_mean_reframe = math_mean.pivot(columns = math_index[1], values = "math_score")
#math_mean_reframe

#math_mean_reframe = students_df.pivot(index = ["school_name","grade"], values = "math_score")
#math_mean_reframe

#math_mean_reframe = math_mean.pivot(index= "Student ID", columns='math_score' , values='reading_score')
#math_mean_reframe.head()

# Create a new variable that holds the sum of our groups
#math_score_students_school_series = math_score_students_school.mean()
#math_score_students_school_series.head()
#math_score_students_school_series.columns
#math_scores = math_score_students_school_series.keys()
#math_scores
#Index(['Student ID', 'reading_score', 'math_score'], dtype='object')

Math Scores By Grade

In [49]:
#Math Scores By Grade
math_scores = students_df[["school_name", "math_score", "grade"]]
math_scores

math_scores_df = math_scores.pivot_table(index='school_name',columns='grade')
math_scores_df

                      math_score
grade                       10th       11th       12th        9th
school_name
Bailey High School     76.996772  77.515588  76.492218  77.083676
Cabrera High School    83.154506  82.765560  83.277487  83.094697
Figueroa High School   76.539974  76.884344  77.151369  76.403037
Ford High School       77.672316  76.918058  76.179963  77.361345
Griffin High School    84.229064  83.842105  83.356164  82.044010
Hernandez High School  77.337408  77.136029  77.186567  77.438495
Holden High School     83.429825  85.000000  82.855422  83.787402
Huang High School      75.908735  76.446602  77.225641  77.027251
Johnson High School    76.691117  77.491653  76.863248  77.187857
Pena High School       83.372000  84.328125  84.121547  83.625455
Rodriguez High School  76.612500  76.395626  77.690748  76.859966
Shelton High School    82.917411  83.383495  83.778976  83.420755
Thomas High School     83.087886  83.498795  83.497041  83.590022
Wilson High School     83.724422  83.195326  83.035794  83.085578
Wright High School     84.010288  83.836782  83.644986  83.264706

Reading Scores By Grade

In [50]:
#Reading Scores By Grade
reading_scores = students_df[["school_name", "reading_score", "grade"]]
reading_scores

reading_scores_df = reading_scores.pivot_table(index='school_name',columns='grade')
reading_scores_df

                      reading_score
grade                          10th       11th       12th        9th
school_name
Bailey High School        80.907183  80.945643  80.912451  81.303155
Cabrera High School       84.253219  83.788382  84.287958  83.676136
Figueroa High School      81.408912  80.640339  81.384863  81.198598
Ford High School          81.262712  80.403642  80.662338  80.632653
Griffin High School       83.706897  84.288089  84.013699  83.369193
Hernandez High School     80.660147  81.396140  80.857143  80.866860
Holden High School        83.324561  83.815534  84.698795  83.677165
Huang High School         81.512386  81.417476  80.305983  81.290284
Johnson High School       80.773431  80.616027  81.227564  81.260714
Pena High School          83.612000  84.335938  84.591160  83.807273
Rodriguez High School     80.629808  80.864811  80.376426  80.993127
Shelton High School       83.441964  84.373786  82.781671  84.122642
Thomas High School        84.254157  83.585542  83.831361  83.728850
Wilson High School        84.021452  83.764608  84.317673  83.939778
Wright High School        83.812757  84.156322  84.073171  83.833333

Scores by School Spending

In [57]:
#Scores by School Spending

# Creating Bins 
spending_bins = [0, 585, 615, 645, 675]
group_names = ["<$585", "$585-615", "$615-645", "$645-675"]

schools_summary_noformat_df.head()
schools_summary_noformat_df.dtypes
#print(schools_summary_noformat_df["Per_student_budget"].count())

# Replace all NaN values with 0 
#schools_summary_noformat_df["Per_student_budget"] = schools_summary_noformat_df["Per_student_budget"].fillna(0)

# Slice the data and place it into bins
schools_summary_noformat_df["Spending Ranges(per Student)"]= pd.cut(schools_summary_noformat_df["Per_student_budget"], spending_bins, labels=group_names).head()
schools_summary_noformat_df.head()

# Create a GroupBy object based upon "View Group"
schools_score_spending = schools_summary_noformat_df.groupby("Spending Ranges(per Student)")

# Find how many rows fall into each bin
#print(schools_score_spending["Per_student_budget"].mean())

# Get the average of each column within the GroupBy object
schools_score_spending_df = schools_score_spending[["avg_math_score", "avg_reading_score", "percent_passing_math","percent_passing_reading", "Overall_passing_rate"]].mean()




#Renaming columns in dataframe

schools_score_spending_rename = schools_score_spending_df.rename(columns={"avg_math_score":"Average Math Score",
                                                                          "avg_reading_score":"Average Reading Score",
                                                                          "percent_passing_math":"% Passing Math",
                                                                          "percent_passing_reading":"% Passing Reading",
                                                                          "Overall_passing_rate":"Overall Passing Rate"})

schools_score_spending_rename

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
Spending Ranges(per Student),,,,,
<$585,NaN,NaN,NaN,NaN,NaN
$585-615,83.359455,83.725724,93.867121,95.854628,94.860875
$615-645,80.031633,82.487389,79.690421,88.939099,84.314760
$645-675,76.959583,81.058567,66.218444,81.089710,73.654077

Scores by School Size

In [58]:
#Scores by School Size

size_bins = [0, 1000, 2000, 5000]
group_names_2 = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]

schools_join_countmath_df.head()
schools_join_countmath_df.dtypes
#print(schools_join_countmath_df["Per_student_budget"].count())

# Slice the data and place it into bins
schools_join_countmath_df["School Size"]= pd.cut(schools_join_countmath_df["size"], size_bins, labels=group_names_2).head()
schools_join_countmath_df.head()

# Create a GroupBy object based upon "View Group"
schools_score_size = schools_join_countmath_df.groupby("School Size")

# Find how many rows fall into each bin
#print(schools_score_size["size"].mean())

# Get the average of each column within the GroupBy object
schools_score_size_df = schools_score_size[["avg_math_score", "avg_reading_score", "percent_passing_math","percent_passing_reading", "Overall_passing_rate"]].mean()




#Renaming columns in dataframe

schools_score_size_rename = schools_score_size_df.rename(columns={"avg_math_score":"Average Math Score",
                                                                         "avg_reading_score":"Average Reading Score",
                                                                         "percent_passing_math":"% Passing Math",
                                                                         "percent_passing_reading":"% Passing Reading",
                                                                         "Overall_passing_rate":"Overall Passing Rate"})

schools_score_size_rename

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
School Size,,,,,
Small (<1000),NaN,NaN,NaN,NaN,NaN
Medium (1000-2000),83.355477,83.771241,93.629746,96.496796,95.063271
Large (2000-5000),76.876977,81.091718,66.141786,80.972885,73.557335

Scores by School Type

In [60]:
#Scores by School Type

schools_score_type = schools_summary_noformat_df.groupby(['type'])[["type",
                                                             "avg_math_score",
                                                             "avg_reading_score",
                                                             "percent_passing_math",
                                                             "percent_passing_reading",
                                                             "Overall_passing_rate"]].mean()
schools_score_type.head()


#Renaming columns in dataframe
school_score_type_rename_df = schools_score_type.rename(columns={"type":"School Type",
                                                             "avg_math_score": "Average Math Score",
                                                             "avg_reading_score": "Average Reading Score",
                                                             "percent_passing_math": "% Passing Math",
                                                             "percent_passing_reading": "% Passing Reading",
                                                             "Overall_passing_rate": "% Overall Passing Rate"})
school_score_type_rename_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
type,,,,,
Charter,83.473852,83.896421,93.620830,96.586489,95.103660
District,76.956733,80.966636,66.548453,80.799062,73.673757